In [116]:
import numpy as np
import pandas as pd

Seriler/ Series

In [117]:
sozluk = {"Ankara":6,"Merisn":33,"Adana":1,"İzmir":34,"Diyarbakır":21}

pd.Series(sozluk)

Ankara         6
Merisn        33
Adana          1
İzmir         34
Diyarbakır    21
dtype: int64

In [118]:
sehirler = ["Adana","Mersin","İstanbul"] #Liste
plaka = [1,33,34]
pd.Series(sehirler,plaka)

1        Adana
33      Mersin
34    İstanbul
dtype: object

In [119]:
pd.Series(data=sehirler,index=plaka,)

1        Adana
33      Mersin
34    İstanbul
dtype: object

In [120]:
numpyPlaka = np.array(plaka)
numpySehirler = np.array(sehirler)
pd.Series(numpyPlaka,numpySehirler)

Adana        1
Mersin      33
İstanbul    34
dtype: int32

In [121]:
hayvanlar1 =pd.Series(index= ["Aslan","Kaplan","Dodo"], data=[True,True,False])
hayvanlar1

Aslan      True
Kaplan     True
Dodo      False
dtype: bool

In [122]:
names = ["Ahmet","Özgür","Ayşe"]
yarisma1 = pd.Series(index=names,data=[80,75,65])
yarisma1

Ahmet    80
Özgür    75
Ayşe     65
dtype: int64

In [123]:
yarisma2 = pd.Series(index=names,data=[80,45,40])
yarisma1+yarisma2

Ahmet    160
Özgür    120
Ayşe     105
dtype: int64

In [124]:
names2 = ["Samet","Ayşe","Özgür"]
yarisma2 = pd.Series(index=names2,data=[50,20,30])
yarisma1+yarisma2

Ahmet      NaN
Ayşe      85.0
Samet      NaN
Özgür    105.0
dtype: float64

##Data Frame

In [125]:
data = np.random.randn(4,2)
data

array([[-0.19004058, -1.09021255],
       [-0.38575331,  0.5333602 ],
       [ 1.74551822,  0.58702937],
       [ 1.82077501,  0.85946986]])

In [126]:
dataFrame = pd.DataFrame(data)
dataFrame

          0         1
0 -0.190041 -1.090213
1 -0.385753  0.533360
2  1.745518  0.587029
3  1.820775  0.859470

In [127]:
dataFrame[0]

0   -0.190041
1   -0.385753
2    1.745518
3    1.820775
Name: 0, dtype: float64

In [128]:
yeniDataFrame = pd.DataFrame(data,index=["A","B","C","D"],columns=["X","Y"])
yeniDataFrame

          X         Y
A -0.190041 -1.090213
B -0.385753  0.533360
C  1.745518  0.587029
D  1.820775  0.859470

In [129]:
yeniDataFrame["X"]

A   -0.190041
B   -0.385753
C    1.745518
D    1.820775
Name: X, dtype: float64

In [130]:
yeniDataFrame.loc["A":"C"]
# yeniDataFrame.iloc[1]  // index bazlı çalışır

          X         Y
A -0.190041 -1.090213
B -0.385753  0.533360
C  1.745518  0.587029

In [131]:
yeniDataFrame

          X         Y
A -0.190041 -1.090213
B -0.385753  0.533360
C  1.745518  0.587029
D  1.820775  0.859470

In [132]:
yeniDataFrame["Z"] = [2,3,4,6]
print(yeniDataFrame)

          X         Y  Z
A -0.190041 -1.090213  2
B -0.385753  0.533360  3
C  1.745518  0.587029  4
D  1.820775  0.859470  6

In [133]:
dropped = yeniDataFrame.drop(columns="Z") #use axis = 1  column
print(dropped)
print(yeniDataFrame)

          X         Y
A -0.190041 -1.090213
B -0.385753  0.533360
C  1.745518  0.587029
D  1.820775  0.859470
          X         Y  Z
A -0.190041 -1.090213  2
B -0.385753  0.533360  3
C  1.745518  0.587029  4
D  1.820775  0.859470  6

In [134]:
yeniDataFrame.drop("Z",axis=1,inplace=True)
yeniDataFrame

          X         Y
A -0.190041 -1.090213
B -0.385753  0.533360
C  1.745518  0.587029
D  1.820775  0.859470

In [135]:
yeniDataFrame <0

       X      Y
A   True   True
B   True  False
C  False  False
D  False  False

In [136]:
yeniDataFrame[yeniDataFrame<0]

          X         Y
A -0.190041 -1.090213
B -0.385753       NaN
C       NaN       NaN
D       NaN       NaN

In [137]:
print(yeniDataFrame)
yeniDataFrame[yeniDataFrame["X"] < 0]

          X         Y
A -0.190041 -1.090213
B -0.385753  0.533360
C  1.745518  0.587029
D  1.820775  0.859470

          X         Y
A -0.190041 -1.090213
B -0.385753  0.533360

In [138]:
yeniDataFrame.reset_index()

  index         X         Y
0     A -0.190041 -1.090213
1     B -0.385753  0.533360
2     C  1.745518  0.587029
3     D  1.820775  0.859470

In [139]:
yeniDataFrame

          X         Y
A -0.190041 -1.090213
B -0.385753  0.533360
C  1.745518  0.587029
D  1.820775  0.859470

In [140]:
yeniHarfler = ["Q","W","E","R"]
yeniDataFrame["yeniIndex"] = (yeniHarfler)
print(yeniDataFrame)

          X         Y yeniIndex
A -0.190041 -1.090213         Q
B -0.385753  0.533360         W
C  1.745518  0.587029         E
D  1.820775  0.859470         R

In [141]:

# yeniDataFrame.set_index("yeniIndex",inplace=True)
yeniDataFrame

          X         Y yeniIndex
A -0.190041 -1.090213         Q
B -0.385753  0.533360         W
C  1.745518  0.587029         E
D  1.820775  0.859470         R

In [142]:
yeniDataFrame.loc["Q"]

KeyError: 'Q'

In [ ]:
filimlerCategory = ["yerli","yerli","yabancı","yerli"]
filimler = ["Sağ Salim","Düğün Dernek","Social Network","Enişte 2"]
birlesmis = list(zip(filimlerCategory,filimler))
birlesmis.sort() # sort yerine başka bir şekilde gruplandırma olmalı ?
print(birlesmis)

[('yabancı', 'Social Network'), ('yerli', 'Düğün Dernek'), ('yerli', 'Enişte 2'), ('yerli', 'Sağ Salim')]

In [ ]:
filimler = pd.MultiIndex.from_tuples(birlesmis)
imdb = [50,60,70,55]
filimImdb = pd.DataFrame(index=filimler,data=imdb,columns=["Imdb"])
filimImdb

                        Imdb
yabancı Social Network    50
yerli   Düğün Dernek      60
        Enişte 2          70
        Sağ Salim         55

In [145]:
sehirler = ["Istanbul","Ankara","izmir"]
gunler = ["Pazartesi","Salı","Çarşamba"]
havaDurumu = pd.DataFrame(index=gunler,columns=sehirler)
havaDurumu.loc["Pazartesi"] = [12,6,22]
havaDurumu.loc["Salı"] = [12,6,np.NaN]
havaDurumu.loc["Çarşamba"] = [np.NaN,6,22]
havaDurumu

          Istanbul Ankara izmir
Pazartesi       12      6    22
Salı            12      6   NaN
Çarşamba       NaN      6    22

In [147]:
print(havaDurumu.dropna())
print("-------------")
havaDurumu.dropna(axis=1)

          Istanbul Ankara izmir
Pazartesi       12      6    22
-------------

          Ankara
Pazartesi      6
Salı           6
Çarşamba       6

In [157]:
havaDurumu["Antalya"] = [np.nan,np.nan,np.nan]
havaDurumu
# havaDurumu

          Istanbul Ankara izmir  Antalya
Pazartesi       12      6    22      NaN
Salı            12      6   NaN      NaN
Çarşamba       NaN      6    22      NaN

In [159]:
havaDurumu.dropna(axis =1,thresh=2) #Kolonlarda ikiden fazla Nan varsa colonu kaldırıyor

          Istanbul Ankara izmir
Pazartesi       12      6    22
Salı            12      6   NaN
Çarşamba       NaN      6    22

In [161]:
havaDurumu.fillna(33)

           Istanbul  Ankara  izmir  Antalya
Pazartesi        12       6     22     33.0
Salı             12       6     33     33.0
Çarşamba         33       6     22     33.0

In [162]:
maasSozlugu = {
    "Depertman" : ["Software","Software","Software","3D Art","3D Art"],
    "Names": ["Ahmet","Ayşe","Ali","Veli","Fatma"],
    "Maas":[2500,2520,1250,3500,2500]
}
maasDataFrame = pd.DataFrame(maasSozlugu)

In [167]:
maasDataFrame.min()

Depertman    3D Art
Names         Ahmet
Maas           1250
dtype: object

In [173]:
groupedFrame = maasDataFrame.groupby("Depertman")

In [176]:
groupedFrame.count()

           Names  Maas
Depertman
3D Art         2     2
Software       3     3

In [177]:
groupedFrame.describe()

           Maas
          count    mean         std     min     25%     50%     75%     max
Depertman
3D Art      2.0  3000.0  707.106781  2500.0  2750.0  3000.0  3250.0  3500.0
Software    3.0  2090.0  727.530068  1250.0  1875.0  2500.0  2510.0  2520.0